### «Последняя цифра числа»

#### Условие

Дано натуральное число. Выведите его последнюю цифру.

```python
x = int(input())
print(x % 10)
```

### «МКАД»

#### Условие

Длина Московской кольцевой автомобильной дороги —109 километров. Байкер Вася стартует с нулевого километра МКАД и едет со скоростью vкилометров в час. На какой отметке он остановится через tчасов?
Программа получает на вход значение vи t. Если v>0, то Вася движется в положительном направлении по МКАД, если же значение v<0
, то в отрицательном.
Программа должна вывести целое число от 0 до 108 — номер отметки, на которой остановится Вася.

```python
v = int(input('v : '))
t = int(input('t : '))
x = ((v * t) % 109)
print(x)
```

### «Дробная часть»

#### Условие

Дано положительное действительное число X. Выведите его дробную часть.

```python
import math
x = float(input())
y = x-math.floor(x)
print(y)
```

### «Первая цифра после точки»

#### Условие

Дано положительное действительное число X. Выведите его первую цифру после десятичной точки.

```python
x = float(input())
print(int(x * 10) % 10)
```

### Автопробег»

#### Условие

За день машина проезжает n километров. Сколько дней нужно, чтобы проехать маршрут длиной m километров? Программа получает на вход числа n и m.

```python
n = int(input('n : '))
m = int(input('m : '))
if m % n == 0:
    print(m // n)
else:
    print ((m // n) + 1)
```

### «Стоимость покупки»

#### Условие

Пирожок в столовой стоит a рублей и b копеек. Определите, сколько рублей и копеек нужно заплатить за n пирожков. Программа получает на вход три числа: a, b, n, и должна вывести два числа: стоимость покупки в рублях и копейках.

```python
a = int(input('a : '))
b = int(input('b : '))
n = int(input('n : '))

a = a * n
b = b * n

if b >= 100:
    a = a + b // 100
    b = b % 100
    
print(a,b)
```

### «Число десятков»

#### Условие

Дано натуральное число. Найдите число десятков в его десятичной записи.

```python
n = int(input())
print(n // 10 % 10)
```

### «Сумма цифр»

#### Условие

Дано трехзначное число. Найдите сумму его цифр.

```python
a = int(input())
s = 0
for n in str(a):
    s = s + int(n) 
print(s)
```

### «Улитка»

#### Условие

Улитка ползет по вертикальному шесту высотой h  метров, поднимаясь за день на a метров, а за ночь спускаясь на b метров. На какой день улитка доползет до вершины шеста?
Программа получает на вход натуральные числа h, a, b.
Программа должна вывести одно натуральное число. Гарантируется, что a>b.

```python
import math
h = int(input('h : '))
a = int(input('a : '))
b = int(input('b : '))

print(math.ceil(1+((h-a) / (a-b))))
```

### «Гипотенуза»

#### Условие

Дано два числа _**a**_ и _**b**_. Выведите гипотенузу треугольника с заданными катетами.

```python
import math
 
a = int(input())
b = int(input())
c = math.sqrt(b**2 + a**2)
print(c)
```

### «Часы - 1»

#### Условие

С начала суток прошло H часов, M минут, S секунд (0 ≤ H < 12, 0 ≤ M < 60, 0 ≤ S < 60). По данным числам H, M, S определите угол (в градусах), на который повернулаcь часовая стрелка с начала суток и выведите его в виде действительного числа.

```python
h = int(input('h : '))
m = int(input('m : '))
s = int(input('s : '))
x = (h * 30) + (m * 0.5) + (s * 0.0083333333333333)
print(x)
```

### «Часы - 2»

#### Условие

С начала суток часовая стрелка повернулась на угол в α градусов. Определите на какой угол повернулась минутная стрелка с начала последнего часа. Входные и выходные данные — действительные числа.

```python
a = float(input('a : '))  
print(a % 30 * 12)
```

### «Часы - 3»

#### Условие

С начала суток часовая стрелка повернулась на угол в α градусов. Определите сколько полных часов, минут и секунд прошло с начала суток, то есть решите задачу, обратную задаче «Часы - 1». Запишите ответ в три переменные и выведите их на экран.

```python
angle = float(input())
print(int(angle // 30), int(angle % 30 * 2), int(angle % 0.5 * 120))
```

### «Проценты»

#### Условие

Процентная ставка по вкладу составляет P процентов годовых, которые прибавляются к сумме вклада. Вклад составляет X рублей Y копеек. Определите размер вклада через год.
Программа получает на вход целые числа P, X, Y и должна вывести два числа: величину вклада через год в рублях и копейках. Дробная часть копеек отбрасывается.

```python
p = int(input('p : '))
x = int(input('x : '))
y = int(input('y : '))
a = (x * 100 + y) * (100 + p) / 10000
print(int(a))
print(int(a * 100 % 100))
```

