### «Четные индексы»

#### Условие

Выведите все элементы списка с четными индексами (то есть `A[0]`, `A[2]`, `A[4]`, ...).

```python
a = input().split()
for i in range(0, len(a), 2):
    print(a[i])
```

### «Четные элементы»

#### Условие

Выведите все четные элементы списка. При этом используйте цикл `for`, перебирающий элементы списка, а не их индексы!

```python
s=input()
a=[int(s) for s in s.split()]
for i in a:
    if int(i)%2 == 0:
       print(i, end=' ')
```

### «Больше предыдущего»

#### Условие

Дан список чисел. Выведите все элементы списка, которые больше предыдущего элемента.

```python
a = [int(i) for i in input().split()]
for i in range(1, len(a)):
    if a[i] > a[i - 1]:
        print(a[i])
```

### «Соседи одного знака»

#### Условие

Дан список чисел. Если в нем есть два соседних элемента одного знака, выведите эти числа. Если соседних элементов одного знака нет — не выводите ничего. Если таких пар соседей несколько — выведите первую пару.

```python
a = [int(i) for i in input().split()]
for i in range(1, len(a)):
    if a[i - 1] * a[i] > 0:
        print(a[i - 1], a[i])
        break 
```

### «Больше своих соседей»

#### Условие

Дан список чисел. Определите, сколько в этом списке элементов, которые больше двух своих соседей, и выведите количество таких элементов. Крайние элементы списка никогда не учитываются, поскольку у них недостаточно соседей.

```python
a = input().split() 
m = 0
for i in range(1, len(a)-1):
    if int(a[i-1]) < int(a[i]) and int(a[i]) > int(a[i+1]):
        m += 1
print(m)
```

### «Наибольший элемент»

#### Условие

Дан список чисел. Выведите значение наибольшего элемента в списке, а затем индекс этого элемента в списке. Если наибольших элементов несколько, выведите индекс первого из них.

```python
a = input().split() # список строк
max = int(a[0])
max_index = 0
for i in range(1, len(a)):
    n = int(a[i])
    if n > max:
        max = n
        max_index = i
print(max, max_index)
```

### «Шеренга»

#### Условие

Петя перешёл в другую школу. На уроке физкультуры ему понадобилось определить своё место в строю. Помогите ему это сделать.
Программа получает на вход невозрастающую последовательность натуральных чисел, означающих рост каждого человека в строю. После этого вводится число X – рост Пети. Все числа во входных данных натуральные и не превышают 200.
Выведите номер, под которым Петя должен встать в строй. Если в строю есть люди с одинаковым ростом, таким же, как у Пети, то он должен встать после них.

```python
a = input().split() # список строк
x = int(input())
x_index = 0
for i in range(0, len(a)):
    n = int(a[i])
    if n >= x:
        x_index = i + 1
print(x_index + 1)
```

### «Количество различных элементов»

#### Условие

Дан список, упорядоченный по неубыванию элементов в нем. Определите, сколько в нем различных элементов.

```python
 a = input().split()
sum_index = 0
for i in range(0, len(a) - 1):
    if int(a[i]) != int(a[i + 1]):
        sum_index += 1
print(sum_index + 1)
```

### «Переставить соседние»

#### Условие

Переставьте соседние элементы списка (`A[0]` c `A[1]`, `A[2]` c `A[3]` и т. д.). Если элементов нечетное число, то последний элемент остается на своем месте.

```python
a = [int(i) for i in input().split()]
for i in range(1, len(a), 2):
    a[i - 1], a[i] = a[i], a[i - 1]
print(' '.join([str(i) for i in a]))
```

### «Переставить min и max»

#### Условие

В списке все элементы различны. Поменяйте местами минимальный и максимальный элемент этого списка.

```python
a = list(map(int, input().split()))
b = a.index(min(a))
c = a.index(max(a))
a[b], a[c] = a[c], a[b]
print(*a)
```

### «Удалить элемент»

#### Условие

Дан список из чисел и индекс элемента в списке k. Удалите из списка элемент с индексом k, сдвинув влево все элементы, стоящие правее элемента с индексом k.
Программа получает на вход список, затем число `k`. Программа сдвигает все элементы, а после этого удаляет последний элемент списка при помощи метода `pop()` без параметров.
Программа должна осуществлять сдвиг непосредственно в списке, а не делать это при выводе элементов. Также нельзя использовать дополнительный список. Также не следует использовать метод `pop(k)` с параметром.

```python
a = [int(s) for s in input().split()]
k = int(input())
for i in range(k + 1, len(a)):
    a[i - 1] = a[i]
a.pop()
print(' '.join([str(i) for i in a]))
```

### «Вставить элемент»

#### Условие

Дан список целых чисел, число `k` и значение `C`. Необходимо вставить в список на позицию с индексом `k` элемент, равный `C`, сдвинув все элементы, имевшие индекс не менее `k`, вправо.
Поскольку при этом количество элементов в списке увеличивается, после считывания списка в его конец нужно будет добавить новый элемент, используя метод `append`.
Вставку необходимо осуществлять уже в считанном списке, не делая этого при выводе и не создавая дополнительного списка.

```python
a = [int(s) for s in input().split()]
 
k, C = [int(s) for s in input().split()]
 
a.append(0)
for i in range(len(a) - 1, k, -1):
    a[i] = a[i - 1]
a[k] = C
print(' '.join([str(i) for i in a]))
```

### «Количество совпадающих пар»

#### Условие

Дан список чисел. Посчитайте, сколько в нем пар элементов, равных друг другу. Считается, что любые два элемента, равные друг другу образуют одну пару, которую необходимо посчитать.

```python
a = [int(s) for s in input().split()]
counter = 0
for i in range(len(a)):
    for j in range(i + 1, len(a)):
        if a[i] == a[j]:
            counter += 1
print(counter)
```

### «Уникальные элементы»

#### Условие

Дан список. Выведите те его элементы, которые встречаются в списке только один раз. Элементы нужно выводить в том порядке, в котором они встречаются в списке.

```python
a = [int(s) for s in input().split()]
for i in range(len(a)):
    for j in range(len(a)):
        if i != j and a[i] == a[j]:
            break
    else:
        print(a[i], end=' ')
```

### «Кегельбан»

#### Условие

_N_ кеглей выставили в один ряд, занумеровав их слева направо числами от _1_ до _N_. Затем по этому ряду бросили _K_ шаров, при этом _i_-й шар сбил все кегли с номерами от _li_ до _ri_ включительно. Определите, какие кегли остались стоять на месте.
Программа получает на вход количество кеглей _N_ и количество бросков _K_. Далее идет _K_ пар чисел _li_, _ri_, при этом _1≤ li≤ ri≤ N_.
Программа должна вывести последовательность из _N_ символов, где _j_-й символ есть “`I`”, если _j_-я кегля осталась стоять, или “`.`”, если _j_-я кегля была сбита.

```python
n, k = [int(s) for s in input().split()]
bahn = ['I'] * n
for i in range(k):
    left, right = [int(s) for s in input().split()]
    for j in range(left - 1, right):
        bahn[j] = '.'
print(''.join(bahn))
```

### «Ферзи»

#### Условие

Известно, что на доске 8×8 можно расставить 8 ферзей так, чтобы они не били друг друга. Вам дана расстановка 8 ферзей на доске, определите, есть ли среди них пара бьющих друг друга.
Программа получает на вход восемь пар чисел, каждое число от 1 до 8 — координаты 8 ферзей. Если ферзи не бьют друг друга, выведите слово `NO`, иначе выведите `YES`.

```python
n = 8
x = []
y = []
for i in range(n):
    new_x, new_y = [int(s) for s in input().split()]
    x.append(new_x)
    y.append(new_y)
 
correct = True
for i in range(n):
    for j in range(i + 1, n):
        if x[i] == x[j] or y[i] == y[j] or abs(x[i] - x[j]) == abs(y[i] - y[j]):
            correct = False
 
if correct:
    print('NO')
else:
    print('YES')
```

