### «Делаем срезы»

#### Условие

Дана строка.
Сначала выведите третий символ этой строки.
Во второй строке выведите предпоследний символ этой строки.
В третьей строке выведите первые пять символов этой строки.
В четвертой строке выведите всю строку, кроме последних двух символов.
В пятой строке выведите все символы с четными индексами (считая, что индексация начинается с 0, поэтому символы выводятся начиная с первого).
В шестой строке выведите все символы с нечетными индексами, то есть начиная со второго символа строки.
В седьмой строке выведите все символы в обратном порядке.
В восьмой строке выведите все символы строки через один в обратном порядке, начиная с последнего.
В девятой строке выведите длину данной строки.

```python
s = input()
print(s[2])
print(s[-2])
print(s[:5])
print(s[:-2])
print(s[::2])
print(s[1::2])
print(s[::-1])
print(s[::-2])
print(len(s))
```

### «Количество слов»

#### Условие

Дана строка, состоящая из слов, разделенных пробелами. Определите, сколько в ней слов. Используйте для решения задачи метод `count`.

```python
a = input()
print(a.count(" ")+1)
```

### «Две половинки»

#### Условие

Дана строка. Разрежьте ее на две равные части (если длина строки — четная, а если длина строки нечетная, то длина первой части должна быть на один символ больше). Переставьте эти две части местами, результат запишите в новую строку и выведите на экран.
При решении этой задачи не стоит пользоваться инструкцией `if`.

```python
s = input()
l = len(s)//2+len(s)%2
a = s[l:]
b = s[:l]
print(a+b)
```

### «Переставить два слова»

#### Условие

Дана строка, состоящая ровно из двух слов, разделенных пробелом. Переставьте эти слова местами. Результат запишите в строку и выведите получившуюся строку.
При решении этой задачи не стоит пользоваться циклами и инструкцией `if`.

```python
n = input()
x = n.find(' ')
print(n[x + 1:] + n[x] + n[:x])
```


### «Первое и последнее вхождения»

#### Условие

Дана строка. Если в этой строке буква `f` встречается только один раз, выведите её индекс. Если она встречается два и более раз, выведите индекс её первого и последнего появления. Если буква `f` в данной строке не встречается, ничего не выводите.
**При решении этой задачи не стоит использовать циклы.**

```python
s = input()
if s.count('f') == 1:
    print(s.find('f'))
elif s.count('f') >= 2:
    print(s.find('f'), s.rfind('f'))
```

### «Второе вхождение»

#### Условие

Дана строка. Найдите в этой строке **второе** вхождение буквы `f`, и выведите индекс этого вхождения. Если буква `f` в данной строке встречается только один раз, выведите число `-1`, а если не встречается ни разу, выведите число `-2`.

```python
s = input()
if s.count('f') == 1:
    print(-1)
elif s.count('f') < 1:
    print(-2)
else:
    print(s.find('f', s.find('f') + 1))
```

### «Удаление фрагмента»

#### Условие

Дана строка, в которой буква `h` встречается минимум два раза. Удалите из этой строки первое и последнее вхождение буквы `h`, а также все символы, находящиеся между ними.

```python
s = input()
s = s[:s.find('h')] + s[s.rfind('h') + 1:]
print(s)
```

### «Обращение фрагмента»

#### Условие

Дана строка, в которой буква `h` встречается как минимум два раза. Разверните последовательность символов, заключенную между первым и последним появлением буквы `h`, в противоположном порядке.

```python
s = input()
a = s[:s.find('h')] 
b = s[s.find('h'):s.rfind('h') + 1]
c = s[s.rfind('h') + 1:]
s = a + b[::-1] + c
print(s)
```

### «Замена подстроки»

#### Условие

Дана строка. Замените в этой строке все цифры `1` на слово `one`.

```python
print(input().replace('1', 'one'))
```

### «Удаление символа»

#### Условие

Дана строка. Удалите из этой строки все символы `@`.

```python
s=input()
print(s.replace('@',''))
```

### «Замена внутри фрагмента»

#### Условие

Дана строка. Замените в этой строке все появления буквы `h` на букву `H`, кроме первого и последнего вхождения.

```python
s=input()
s1=s[s.find('h')+1:s.rfind('h')]
s1=s1.replace('h','H')
print(s[:s.find('h')+1]+s1+s[s.rfind('h'):])
```

### «Удалить каждый третий символ»

#### Условие

Дана строка. Удалите из нее все символы, чьи индексы делятся на 3.

```python
s = input()
t = ''
for i in range(len(s)):
    if i % 3 != 0:
        t = t + s[i]
print(t)
```

