### «Ряд - 1»

#### Условие

Даны два целых числа A и B (при этом A ≤ B). Выведите все числа от A до B включительно.

```python
a = int(input())
b = int(input())

for i in range(a,b+1,1):
    print(i)
```

### «Ряд - 2»

#### Условие

Даны два целых числа A и В. Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.

```python
a = int(input())
b = int(input())
if a < b:
    for i in range(a,b+1,1):
        print(i)
else:
    for i in range(a, b - 1, -1):
        print(i)
```

### «Ряд - 3»

#### Условие

Даны два целых числа A и В, A>B. Выведите все нечётные числа от A до B включительно, в порядке убывания. В этой задаче можно обойтись без инструкции if.

```python
a = int(input())
b = int(input())

if a % 2 == 0:
    a = a - 1

for i in range(a, b - 1, -2):
    print(i)
```

### «Сумма десяти чисел»

#### Условие

Дано 10 целых чисел. Вычислите их сумму. Напишите программу, использующую наименьшее число переменных.

```python
sum = 0
for i in range(10):
    a = int(input())
    sum += a
print(sum)
```

### «Сумма N чисел»

#### Условие

Дано несколько чисел. Вычислите их сумму. Сначала вводите количество чисел N, затем вводится ровно N целых чисел. Какое наименьшее число переменных нужно для решения этой задачи?

```python
n = int(input())
sum = 0
for i in range(n):
    sum += int(input())
print(sum)
```

### «Сумма кубов»

#### Условие

По данному натуральному n вычислите сумму 13+23+33+...+n3.

```python
n = int(input())

sum = 0

for i in range(1, n + 1):
    sum += i ** 3
print(sum)
```

### «Факториал»

#### Условие

Факториалом числа n называется произведение 1 × 2 × ... × n. Обозначение: n!.
По данному натуральному n вычислите значение n!. Пользоваться математической библиотекой math в этой задаче запрещено.

```python
fuck = 1
n = int(input())
for i in range(1, n + 1):
    fuck *= i
print(fuck)
```

### «Сумма факториалов»

#### Условие

По данному натуральном n
вычислите сумму 1!+2!+3!+...+n!. В решении этой задачи можно использовать только один цикл. Пользоваться математической библиотекой math в этой задаче запрещено.

```python
lol = 1
xxx = 0
n = int(input())

for i in range(1, n + 1):  
    lol *= i 
    xxx += lol
print(xxx)
```

### «Количество нулей»

#### Условие

Дано N чисел: сначала вводится число N, затем вводится ровно N целых чисел. Подсчитайте количество нулей среди введенных чисел и выведите это количество. Вам нужно подсчитать количество чисел, равных нулю, а не количество цифр.

```python
razor = 0

for i in range(int(input())):
    if int(input()) == 0:
        razor += 1
print(razor)
```

### «Лесенка»

#### Условие

По данному натуральному n ≤ 9 выведите лесенку из n ступенек, i-я ступенька состоит из чисел от 1 до i без пробелов.

```python
num = int(input())

show = ''

for i in range(1,num + 1):
    show = show + str(i)
    print(int(show))
```

### «Потерянная карточка»

#### Условие

Для настольной игры используются карточки с номерами от 1 до N. Одна карточка потерялась. Найдите ее, зная номера оставшихся карточек.

Дано число N, далее N − 1 номер оставшихся карточек (различные числа от 1 до N). Программа должна вывести номер потерянной карточки.

Для самых умных: массивами и аналогичными структурами данных пользоваться нельзя.

```python
n = int(input())

sum1 = n
sum2 = 0

for i in range(1, n):
    sum1 += i
    sum2 += int(input())
print(sum1 -sum2)
```

